# **Семинар 4. Группировка. Сводные таблицы**

In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('https://raw.githubusercontent.com/aaparshina/FCI_22-23_data_analysis/main/data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## **Частотные таблицы**

Строятся как правило по категориальным данным

``` python
датафрейм['колонка'].value_counts()
```

In [2]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [3]:
df['Pclass'].value_counts(normalize = True)

3    0.551066
1    0.242424
2    0.206510
Name: Pclass, dtype: float64

## **Методы агрегирования данных**

**Функция агрегирования** - это метод, который принимает несколько отдельных значений и возвращает сводные данные.

### `.mean()`

In [5]:
df['Fare'].mean() #среднее

32.2042079685746

### `.sum()`

In [6]:
df['Fare'].sum() #сумма

28693.9493

### `.min()` and `.max()`

In [7]:
df['Fare'].min()

0.0

In [8]:
df['Fare'].max()

512.3292

### `.count()`

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
df['Cabin'].count() #количество не пропущенных значения в столбце

204

### `.nunique()`

In [11]:
df['Cabin'].nunique() #количество уникальных значений в столбце

147

## **Группировка данных**

### Простейшая группировка

``` python
датафрейм.groupby("столбец группировки")["столбец интереса"].метод агрегирования()
```

Столбец группировки:
- Категориальные переменные

Столбец интереса:
- Количественные переменные
- Категориальные переменные

Найдем среднюю цену за билет в разных портах:

In [24]:
df.groupby("Embarked")["Fare"].mean()

Embarked
C    59.954144
Q    13.276030
S    27.079812
Name: Fare, dtype: float64

### Несколько столбцов интереса

``` python
датафрейм.groupby("столбец группировки")[["ст. интереса 1", "ст. интереса 2", ...]].метод агрегирования()
```

Найдем среднюю цену за билет и среднй возраст людей в разных портах:

In [25]:
df.groupby('Embarked')[['Fare', 'Age']].mean()

               Fare        Age
Embarked
C         59.954144  30.814769
Q         13.276030  28.089286
S         27.079812  29.445397

### Несколько столбцов группировки

``` python
датафрейм.groupby(["ст. группировки 1", "ст. группировки 2", ...])["столбец интереса"].метод агрегирования()
```

Найдем среднюю цену за билет для мужчин и женщин из разных портов:

In [26]:
df.groupby(['Sex', 'Embarked'])['Fare'].mean()

Sex     Embarked
female  C           75.169805
        Q           12.634958
        S           38.740929
male    C           48.262109
        Q           13.838922
        S           21.711996
Name: Fare, dtype: float64

### Несколько методов агрегирования

In [31]:
df.groupby("Embarked")["Fare"].agg(['mean', 'sum'])

               mean         sum
Embarked
C         59.954144  10072.2962
Q         13.276030   1022.2543
S         27.079812  17439.3988

In [28]:
help(df.groupby)

Help on method groupby in module pandas.core.frame:

groupby(by=None, axis: 'Axis' = 0, level: 'Level | None' = None, as_index: 'bool' = True, sort: 'bool' = True, group_keys: 'bool' = True, squeeze: 'bool | lib.NoDefault' = <no_default>, observed: 'bool' = False, dropna: 'bool' = True) -> 'DataFrameGroupBy' method of pandas.core.frame.DataFrame instance
    Group DataFrame using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, or list of labels
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If a list or ndarray of length
        equal to the selected axis is passed (see the `groupby user guide
        <https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#splitting-an-object-into-groups>`_),
        the values are used as-is to determine the groups. A label or list
        of labels may be passed to group by the columns in ``self``.
        Notice that a tuple is interpreted as a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1).
    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels.
    as_index : bool, default True
        For aggregated output, return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output.
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group.
    group_keys : bool, default True
        When calling apply, add group keys to index to identify pieces.
    squeeze : bool, default False
        Reduce the dimensionality of the return type if possible,
        otherwise return a consistent type.

        .. deprecated:: 1.1.0

    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.
    dropna : bool, default True
        If True, and if group keys contain NA values, NA values together
        with row/column will be dropped.
        If False, NA values will also be treated as the key in groups.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrameGroupBy
        Returns a groupby object that contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <https://pandas.pydata.org/pandas-docs/stable/groupby.html>`__ for more
    detailed usage and examples, including splitting an object into groups,
    iterating through groups, selecting a group, aggregation, and more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Captive', 'Wild', 'Captive', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
    ...                   index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Captive      390.0
           Wild         350.0
    Parrot Captive       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level="Type").mean()
             Max Speed
    Type
    Captive      210.0
    Wild         185.0

    We can also choose to include NA in group keys or not by setting
    `dropna` parameter, the default setting is `True`.

    >>> l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by=["b"]).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5

    >>> df.groupby(by=["b"], dropna=False).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5
    NaN 1   4

    >>> l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by="a").sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0

    >>> df.groupby(by="a", dropna=False).sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0
    NaN 12.3   33.0

## **C2.4**

Датасет содержит следующие признаки:

**category** - в какой категории находится блюдо (завтрак, десерты, рыба и курица и т.д)

**item** - название блюда

**calories** - количество калорий в блюде

**total_fat** - количество жиров (в процентах от дневной нормы)

**calcium** - количество кальция

**sugars** - количество углеводов

**protein** - количество белка

In [32]:
data = pd.read_csv('https://raw.githubusercontent.com/dakasyanenko/media-DA-2023/main/S4%20groupby/mcdonalds.csv')
data.head()

,category,item,calories,total_fat,calcium,sugars,protein
0,Breakfast,Egg McMuffin,300,20,25,3,17
1,Breakfast,Egg White Delight,250,12,25,3,18
2,Breakfast,Sausage McMuffin,370,35,25,2,14
3,Breakfast,Sausage McMuffin with Egg,450,43,30,2,21
4,Breakfast,Sausage McMuffin with Egg Whites,400,35,25,2,21

Для какой категории **разница между минимумом и максимумом калорий** (размах) равна **760**? Напишите название, как в данных (просто скопируйте его, чтобы не опечататься):

In [34]:
gb = data.groupby("category")["calories"].agg(["min", "max"])
gb

                    min   max
category
Beef & Pork         240   750
Beverages             0   280
Breakfast           150  1150
Chicken & Fish      190  1880
Coffee & Tea          0   760
Desserts             45   340
Salads              140   450
Smoothies & Shakes  210   930
Snacks & Sides       15   510

In [35]:
gb["diff"] = gb["max"] - gb["min"]
gb

                    min   max  diff
category
Beef & Pork         240   750   510
Beverages             0   280   280
Breakfast           150  1150  1000
Chicken & Fish      190  1880  1690
Coffee & Tea          0   760   760
Desserts             45   340   295
Salads              140   450   310
Smoothies & Shakes  210   930   720
Snacks & Sides       15   510   495

In [36]:
gb[gb["diff"] == 760]

              min  max  diff
category
Coffee & Tea    0  760   760

## **C6**

Создайте сводную таблицу: в строках должны быть категории (**category**), в колонках белок (**protein**), в ячейках — среднее арифметическое значение белка по категориям.

Блюда какой категории в среднем содержат больше всего белка? В ответ запишите название категории как в данных.

In [45]:
data.groupby("category")["protein"].mean().sort_values(ascending = False)

category
Chicken & Fish        29.111111
Beef & Pork           27.333333
Breakfast             19.857143
Salads                19.833333
Smoothies & Shakes    10.857143
Coffee & Tea           8.863158
Snacks & Sides         8.384615
Desserts               4.000000
Beverages              1.333333
Name: protein, dtype: float64